load-tests/ai-runtime.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 40
    - duration: 120
      arrivalRate: 40

scenarios:
  - name: "AI runtime pressure"
    flow:
      - post:
          url: "/api/ai/leila"
          json:
            message: "اشرح لي درس المعادلات بطريقة بسيطة"