load-tests/ai-streaming.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 25

scenarios:
  - name: "AI tutor streaming pressure"
    flow:
      - post:
          url: "/api/ai/leila"
          json:
            message: "شرحي ليا درس الكسور بطريقة بسيطة"